Testing/load_testing.yml
config:
  target: "http://fastapi-alb-1549973934.us-east-1.elb.amazonaws.com"
  phases:
    - name: Load Testing
      duration: 30  # Duration of the test in seconds
      arrivalRate: 30  # Number of virtual users per second
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Fetch Insights from RDS"
    flow:
      - get:
          url: "/getData"  # Replace with your API endpoint for fetching insights

  # - name: "Access Frontend Pages"
  #   flow:
  #     - get:
  #         url: "/"  # Replace with the frontend page url